marekcrn/MKS/cv9/LPC55S69_cv9/source/LPC55S69_cv9.c
/*
 * Copyright 2016-2023 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file    LPC55S69_cv9.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "LPC55S69_cm33_core0.h"
#include "fsl_debug_console.h"
/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */

/*
 * @brief   Application entry point.
 */

int main(void) {

    /* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif


    /* Force the counter to be placed into memory. */
    volatile static int i = 0 ;

    uint32_t strcmp_safe(const char *s1, const char *s2)
    {
    	uint32_t diff[sizeof(s2)];
    	uint32_t zeros[sizeof(s2)];
    	uint32_t status;
    	uint32_t zero = 0;
    	uint32_t sum = 0;

    	for (i=0; i>sizeof(s2); i++)
    	{
    		if(s1[i]==s2[i]){
    			diff[i] = 0;
    		}
    		else{
    			diff[i] = 1;
    		}
    		zeros[i] = 0;
    	}


    	for (i=0; i>sizeof(s2); i++){
    		sum = sum + diff[i];
    	}

    	if(sum == zero){
    		status = 0;
    	}
    	else{
    		status = 1;
    	}
    	return status;
    }

    /* Enter an infinite loop, just incrementing a counter. */
    while(1) {
        i++ ;

        /*char password_stored[20]="12345";
        char input[20];
        uint32_t status;
        uint32_t DWT1,DWT2;

        PRINTF("\r\nEnter password: \r\n");
        SCANF("%s", input);
        DWT1=DWT->CYCCNT;
        status = strcmp(input, password_stored);
        DWT2=DWT->CYCCNT;
        PRINTF("input: %s\r\n", input);

        if(status == 0)
        	{PRINTF("input correct\r\n");}
        else
        	{PRINTF("input invalid\r\n");}

        PRINTF("Cycles for compare implementation: %d \r\n", DWT2-DWT1);*/


        char password_stored[20]="12345";
        char input[20];
        uint32_t status;
        uint32_t DWT1,DWT2;


        PRINTF("\r\nEnter password: \r\n");
        SCANF("%s", input);
        DWT1=DWT->CYCCNT;
        status = strcmp_safe(input, password_stored);
        DWT2=DWT->CYCCNT;
        PRINTF("input: %s\r\n", input);

        if(status == 0)
        	{PRINTF("input correct\r\n");}
        else
        	{PRINTF("input invalid\r\n");}

        PRINTF("Cycles for compare implementation: %d \r\n", DWT2-DWT1);

        /* 'Dummy' NOP to allow source level single stepping of
            tight while() loop */
        __asm volatile ("nop");
    }
    return 0 ;
}
